# 1. 78을 N - 1자리로 보내기
# 0, 1번째 비교해서: <7, 55>, 78, 12, 42
# 1, 2번째 비교해서: 7,<55, 78>, 12, 42
# 2, 3번째 비교해서: 7, 55, <12, 78>, 42
# 3, 4번째 비교해서: 7, 55, 12, <42, 78>

# 2. 55를 N - 2자리로 보내기
# 0, 1번째 비교해서: <7, 55>, 12, 42, 78
# 1, 2번째 비교해서: 7, <12, 55>, 42, 78
# ...
# 범위: N - 1에서 1까지

def bubble_sort(n, arr):
    for i in range(n-1, 0, -1): # 각 반복이 끝날 때마다 마지막 요소를 제외하여 비교 범위 감소
        for j in range(i):		# 비교할 왼쪽 원소 인덱스 j
            if arr[j] > arr[j+1]:
                arr[j], arr[j+1] = arr[j+1], arr[j]
    return arr

t = bubble_sort(5, [55, 7, 78, 12, 42]) # 리스트 길이, 내부 항목
print(t)




