# 연습문제1
# s = "000000011110000001100000011110011000011000011100111100111111001100111"
# for i in range(0,len(s),7):
#     # 7개씩 끊어서 2진수를 해석하라
#     # print(s[i:i+7])
#     s2 = s[i:i+7]
#     print(int(s2,2))

# 연습문제 2
# s = '0F97A3'
# # zfill은 0을 채워라
# s2 = bin(int(s, 16))[2:].zfill(24) # 16진수를 해석하여 2진수로 변환해라
# print(s2)
# for i in range(0,len(s2),7):
#     s3 = int(s2[i:i+7],2)
#     print(s3, end = ", ")


# 연습문제 3
s = '0DEC'
s2 = bin(int(s,16))[2:].zfill(16)
# print(s2)
code = {
    '001101': 0,
    '010011': 1,
    '111011': 2,
    '110001': 3,
    '100011': 4,
    '110111': 5,
    '001011': 6,
    '111101': 7,
    '011001': 8,
    '101111': 9
}
idx = 0
while idx <= len(s2) - 6:
    psw = s2[idx:idx + 6] # 6자리씩 끊어서
    # 구간내에 일치하는게 있으면 그 값을 출력하고, idx 6증가시킴
    # 없으면 idx 1증가시키고 다시 체크
    if psw in code:
        idx += 6
        print(code[psw], end = " ")
    else:
        idx += 1



