# 1. 78을 N - 1자리로 보내기
# 0, 1번째 비교해서: <7, 55>, 78, 12, 42
# 1, 2번째 비교해서: 7,<55, 78>, 12, 42
# 2, 3번째 비교해서: 7, 55, <12, 78>, 42
# 3, 4번째 비교해서: 7, 55, 12, <42, 78>

# 2. 55를 N - 2자리로 보내기
# 0, 1번째 비교해서: <7, 55>, 12, 42, 78
# 1, 2번째 비교해서: 7, <12, 55>, 42, 78
# ...
# 범위: N - 1에서 1까지

N = 5
num = [55, 7, 78, 12, 42]

for i in range(N-1, 0, -1): # 범위의 끝 위치
    for j in range(i):		# 비교할 왼쪽 원소 인덱스 j
        if num[j] > num[j+1]:
            num[j], num[j+1] = num[j+1], num[j]

print(num)



