# 5 x 5의 2차원 배열
# 대각선 원소의 합
n = int(input())
arr = [list(map(int, input().split())) for _ in range(n)]
s = 0
for i in range(n):
    s += arr[i][i] # 좌측 위에서 우측 아래로 내려가는 대각선
    s += arr[i][n - 1- i] # 우측 위에서 좌측 아래로 내려가는 대각선
s -= arr[5//2][5//2] # 가장 중앙에 있는 값은 2번 더해지므로 차감(행과 열의 크기가 홀수)
print(s)
"""
5
45 15 10 56 23 
96 98 99 40 69 
96 84 49 46 34 
16 64 81 4 11 
10 66 85 55 14 
5
44 91 64 73 62 
78 72 52 73 48 
44 88 55 75 24 
22 72 59 26 62 
87 11 64 79 40 
5
10 10 10 10 10
10 10 10 10 10
10 10 10 10 10
10 10 10 10 10
10 10 10 10 10
"""
